List mockdata = [
  {
    "id": 1,
    "city_name": "هەولێر",
    "city_image":
        "https://cihanuniversity.edu.iq/wp-content/uploads/2018/09/erbil_Cihan_4.jpg",
    "description":
               "دوای ئەوەی قەڵای هەولێر لە لیستی كەلەپووری دنیا تۆمار كرا، تایبەتمەندییەكی جیهانی وەرگرتووە و پێویستە بە پێی رێنوێنییەكانی یونسكۆ، بەڕێوە ببرێت. بەڵام بەهۆی پشتگوێخستنی لەلایەن حكوومەتی هەرێمەوە، وەك سەرۆكی كۆمسیۆنی بووژاندنەوەی قەڵا رای دەگەیەنێت، دوور نییە لە لیستی كەلەپووری جیهانی دەربكرێت، ئەوەش بەهۆی كار نەكردنی حكوومەت بۆ پاراستنی ئەو كەلەپوورە جیهانییە و لادان لە مەرج و رێوشوێنە نێودەوڵەتییەكان."  },
  {
    "id": 2,
    "city_name": "سلێمانی",
    "city_image":
        "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Grand_Millennium_Sulaimani_Hotel_in_Sulaymaniyah%2C_Kurdistan.jpg/280px-Grand_Millennium_Sulaimani_Hotel_in_Sulaymaniyah%2C_Kurdistan.jpg",
    "description":
       "شاری سلێمانی له‌ ساڵی ١٧٨٤ له‌لایه‌ن ئیبراهیم پاشای بابان ه‌وه‌ ئاوه‌دانكراوه‌ته‌وه‌. ئیبراهیم پاشا شاره‌كه‌ی به‌ناوی باوكی‌یه‌وه(سلێمان)پاشا‌ ناوناوه. سلێمانی جگه‌له‌‌وه‌ی ده‌بێته‌ پایته‌ختی میرنشینی بابان له‌هه‌مانكاتدا ده‌بێته‌ مه‌ڵبه‌ندێكی بازرگانی و ڕۆشنبیری ناوچه‌كه"  },
  {
    "id": 3,
    "city_name": "دهۆک",
    "city_image":
        "https://nrtstorageweb.blob.core.windows.net/nrten/14112021812282021123498202112581613901561923.jpg",
    "description":
         "  لە بارەی ناوی دھۆک بۆچوونی جیاواز ھەیە، بەڵام ئەوەی کە لە ھەموویان بەناوبانگترە ئەوەیە کە (دھۆک) بە مانای (دوو چیا، یان دوو ھێلکە) دێت. ناوی ئاشوری شارەکە نوھەدرایە."  },
  {
    "id": 4,
    "city_name": "هەڵەبجە",
    "city_image": "https://media.shafaq.com/media/arcella/1647428105314.jpg",
    "description":
  "ھەڵەبجە (هەڵەبجەی شەهید) (ئینگلیزی: Halabja)ناوەندی پارێزگای ھەڵەبجەیە و بە یەکێک لە شارە گەورە و گرنگەکانی کوردستانی باشوور دەژمێردرێت. دەکەوێتە نێوان ھێڵی درێژی ٤٦ی پلەی ڕۆژھەڵات و ھەر دوو بازنەی پانی ٣٥–٣٦ پلەی باکوور و ٨٣ کم باشووری ڕۆژھەڵاتی شاری سلێمانیەوە. ڕووبەرەکەی ١٥٩٩ کیلۆمەتری چوارگۆشەیە، و ئەو سەردەمەی کە لەسەر پارێزگای سلێمانی بوو %٣٩٬٩ ڕووبەری ھەموو ئەو پارێزگایەی پێک دەھێنا."  },
  {
    "id": 5,
    "city_name": "زاخۆ",
    "city_image":
        "https://d2wqffb2bc8st5.cloudfront.net/resources/files/2019/12/PiraMain.jpg",
    "description":
       "قه‌زای‌ زاخۆ یه‌كێكه‌ له‌ قه‌زاكانی‌ پارێزگای‌ دهۆك له‌ باشوری‌ كوردستان، كه‌ له‌ چوار ناحییه‌ی‌ (ڕزگاری‌، زاخۆ، ده‌ركار، باتیفا)و 190 گوند پێكدێت، ناحیه‌ی‌ زاخۆ ناوه‌ندی‌ قه‌زاكه‌یه‌. شاری‌ زاخۆ ده‌كه‌وێته‌ خوار ڕۆژئاوای‌ ده‌ستی‌ (سندی‌) كه‌ ده‌شتێكی‌ گرنگ و به‌ناوبانگه‌ له‌ ده‌ڤه‌ره‌كه‌ بۆ چاندنی‌ گشتوكاڵ، خاوه‌نی‌ كه‌ش و هه‌وایه‌كی‌ دڵڕفێنه‌و ده‌كه‌وێته‌ سه‌ر ڕووباری‌ (خابور)، كه‌ به‌ نێو شاره‌كه‌دا تێپه‌ڕ ده‌بێت و ده‌یكات به‌ دوو به‌شه‌وه‌ و پردی‌ ده‌لالی‌ به‌ناوبانگی‌ زاخۆی‌ ده‌كه‌وێته‌ سه‌ر، كه‌ مێژووه‌كه‌ی‌ بۆ سه‌رده‌می‌ میرنشینی‌ بادینان ده‌گه‌ڕێته‌وه‌."  },
];